Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E11D.tmx
Source language: en_us
Languages: zh_cn

source: The Art of Pillow Placement
zh_cn: 摆放枕头的艺术

source: Did you know that pillows can create absurd sneeze inducing fits from the aftermath of floating feathers due to an extreme sport called pillow fighting?
zh_cn: 你知道枕头羽毛的飘动会引起不合理的打喷嚏行为吗？这都归咎于一项名为枕头大战的极限运动。

source: But surely so much more pleasure can be derived from these fluffy entities.
zh_cn: 但可以肯定的是这些毛茸茸的可爱小物体给我们生活中带来了如此之多的快乐。

source: Throw pillows offer texture, dimension, depth, personality, seating arrangements and a sense of overall charm and frequently are the gorgeous focal points in your home.
zh_cn: 每一个不同的靠枕都有自己独特的质感、尺寸、深度和个性。想要往家里注入更多绚丽的焦点，那么你可以通过座位的编排来提升家里的整体魅力。

source: Behind the placement of these beautiful members of our home is a science and art into what and where it will fit.
zh_cn: 靠枕就像家里一个美丽的家庭成员，它所摆放的位置代表的是一种科学，一种艺术。

source: And of course there is always that deep question of whether or not they will live up to their name and just get thrown off the sofa after many hard hours of selection, fluffing and of course the art of placement.
zh_cn: 当然重点是我们是否能把它的优点发挥到极致。

source: The following list categorizes five things to take into consideration when choosing your pillows...
zh_cn: 下面是在选择靠枕时需要考虑的五件事情...

source: SHAPE: Round, Circular, Bolster, Square and Rectangular
zh_cn: 形状：圆形枕，环形枕，长枕， 正方形枕和长方形枕

source: Ah, the bolster pillow.
zh_cn: 啊哈，对了，就是长枕。

source: This pillow loves the accompaniment of its other feather filled friends.
zh_cn: 这种长枕可以搭配上其他具有丰盈羽毛的靠枕朋友。

source: While it's truly a beautiful asset, it is not one to stand-alone.
zh_cn: 老实说，长枕真的是一个不错的搭配选择，因为它并不是一个独立的整体。

source: It needs square hips; I mean pillows, to show off its significant curves.
zh_cn: 它需要跟正方形靠枕放在一齐，我的意思是, 靠枕, 最主要的是显示它独特的曲线风格。

source: Remember that every actor has a best supporting actor!
zh_cn: 请记住, 每个演员的背后都有一个最好的配角!

source: MATERIAL: Velvet, Suede, Silk, Cotton, Chenille, Linen, Hemp, Rayon and Polyester Blends, Faux fur, Rayon, Wool, Sheepskin, and Tapestry
zh_cn: 材料：丝绒料，绒面革料，丝绸料，棉制料，松绒线，尼龙料，麻布料，人造纤维和涤纶混纺料，人造毛皮、羊毛、羊皮、和绒绣

source: When choosing the fabric of your pillow, texture is everything.
zh_cn: 当选择靠枕的布料问题时，质料是最优先考虑的先决条件。

source: If you have a sleek leather couch you will want to compliment it using some more organic fabric like linen or hemp.
zh_cn: 如果沙发是皮质品，那么可以尝试考虑有机纤维，像尼龙或大麻纤维来搭配在一起。

source: This will offer great contrast and striking intensity, as well as resolve the issue of slippery seating.
zh_cn: 这样可以形成鲜明的对比，就像解决座位的轻重问题。

source: FINISHES: Tassels, embroidery, fringes, shimmer, sequins, beads, shag, lace, and buttons
zh_cn: 表面材料：流苏、刺绣、条纹、淡光、亮片、小珠子、长绒、花边、和纽扣

source: Take a look around your room.
zh_cn: 环顾一下房间的四周。

source: What do you see?
zh_cn: 你看到了什么？

source: If you have cool sleek modern lines you won't want an overly frilly and embroidered piece that screams I'm Victorian!
zh_cn: 如果你房间设计是井然有序的，那么就不需要再用其他过度的镶边或刺绣来破坏了现在的美好。

source: You can definitely increase some attitude into the living space with a daring shag pillow or two.
zh_cn: 你可以在生活空间上，大胆的增加一到两个毛绒靠枕。

source: SIZE: Small, Medium, Large, Oversized, Floor pillows, accent pillows, and sofa back pillows
zh_cn: 尺寸：小型、中型、大型、超大型、地面式的靠枕, 带有独特风格的抱枕, 和后背式的沙发靠枕

source: If you have a small loveseat you want to be able to do more than sit on the edge of the sofa.
zh_cn: 如果你拥有一张小型的双人小沙发，你会更愿意去设想不同风格，不同大小，不同种类下混搭出来的惊喜效果。

source: Having oversized pillows only works on oversized chairs and the floor.
zh_cn: 大型的靠枕只适用于大型的椅子和地板上。

source: Keep in mind that a million small pillows isn't the answer either.
zh_cn: 记住一百万个小靠枕也不是只有一个单纯的搭配效果。

source: You want diversity; an array of shapes, sizes, colors textures.
zh_cn: 你需要的是多样化，比如：形状，大小，颜色和质感。

source: PURPOSE: Decorative, Accent, Floor and Seating
zh_cn: 用途：装饰，特色，地板和座位

source: Accent pillows are in now way to be considered an afterthought even if they are the ones that fill in the blank spots.
zh_cn: 具有强调功能的抱枕并不单纯只是用来填补空白的一个斑点。

source: They are charming and often the most comfortable in their simplicity, whereas floor pillows are the economic pillow choice of 2012.
zh_cn: 它们可以因为朴素这一特点而使整间房子看起来舒适迷人，而对于地面式靠枕则是2012的经济型选择。

source: They are more reasonably priced than traditionally new seating options. As an added bonus they are an interior designers dream come true as they can go from an exotic accent to someone's backrest in minutes without destroying your perfected look.
zh_cn: 它们比许多传统的靠枕来得更经济实惠，所以它们可以说是一位很好的室内设计师，由于它们的独特，所以一直以来这种靠垫都是备受瞩目的某人专属垫。
